// Module: DE2
// Params: as8,GE2

GE2.exports = function A(B, Q) {
  var I = '';
  ((B = B || 'Run the trap, drop the bass'), (B = B.split('')));
  var G = {
    a: ['@', 'Ą', 'Ⱥ', 'Ʌ', 'Δ', 'Λ', 'Д'],
    b: ['ß', 'Ɓ', 'Ƀ', 'ɮ', 'β', '฿'],
    c: ['©', 'Ȼ', 'Ͼ'],
    d: ['Ð', 'Ɗ', 'Ԁ', 'ԁ', 'Ԃ', 'ԃ'],
    e: ['Ë', 'ĕ', 'Ǝ', 'ɘ', 'Σ', 'ξ', 'Ҽ', '੬'],
    f: ['Ӻ'],
    g: ['ɢ'],
    h: ['Ħ', 'ƕ', 'Ң', 'Һ', 'Ӈ', 'Ԋ'],
    i: ['༏'],
    j: ['Ĵ'],
    k: ['ĸ', 'Ҡ', 'Ӄ', 'Ԟ'],
    l: ['Ĺ'],
    m: ['ʍ', 'Ӎ', 'ӎ', 'Ԡ', 'ԡ', '൩'],
    n: ['Ñ', 'ŋ', 'Ɲ', 'Ͷ', 'Π', 'Ҋ'],
    o: ['Ø', 'õ', 'ø', 'Ǿ', 'ʘ', 'Ѻ', 'ם', '۝', '๏'],
    p: ['Ƿ', 'Ҏ'],
    q: ['্'],
    r: ['®', 'Ʀ', 'Ȑ', 'Ɍ', 'ʀ', 'Я'],
    s: ['§', 'Ϟ', 'ϟ', 'Ϩ'],
    t: ['Ł', 'Ŧ', 'ͳ'],
    u: ['Ʊ', 'Ս'],
    v: ['ט'],
    w: ['Ш', 'Ѡ', 'Ѽ', '൰'],
    x: ['Ҳ', 'Ӿ', 'Ӽ', 'ӽ'],
    y: ['¥', 'Ұ', 'Ӌ'],
    z: ['Ƶ', 'ɀ'],
  };
  return (
    B.forEach(function (D) {
      D = D.toLowerCase();
      var Z = G[D] || [' '],
        Y = Math.floor(Math.random() * Z.length);
      if (typeof G[D] !== 'undefined') I += G[D][Y];
      else I += D;
    }),
    I
  );
};
